{
    "General":{
    "Profession" : "SOFTWARE DEVELOPER",
    "Prenom1" : "JASSER",
    "Prenom2" : "ABD-EL-RAHMEN",
    "Nom" : "GHERIBI",
    "Qualitites" : ["Motivé","Organisé","Polyvalent"],
    "ShortPresentation" : "Etudiant en Deuxième année de B.U.T Informatique",
    "Rubrics" : ["Presentation","Projects","Contact"]
    },
    "Presentation":{
        "Title" : "About Me",
        "Text" : [
            "Je suis étudiant en informatique avec une passion prononcée pour le développement web, le développement logiciel et la cybersécurité.",
            "Chaque ligne de code que j'écris, chaque application que je construis et chaque système que je sécurise sont le reflet de mon engagement envers l'excellence technique.",
            "La capacité de transformer une idée en un projet concret, de structurer les étapes de développement et de veiller à ce que tout se déroule comme prévu est pour moi tout aussi satisfaisant que la programmation elle-même.",
            "Je suis toujours prêt à en apprendre davantage et à travailler sur des projets passionnants."
        ]
    },
    "Contact":{
        "Title" : "Contact",
        "Number" : "07 81 98 77 80",
        "E-mail" : "gheribij59@gmail.com",
        "Link_GitHub" : "https://github.com/TawahinBeirut",
        "Git-Hub" : "Tawahin Beirut"
        
    },
    "Competences":{
        "Title": "Competences",
        "Text" : [
            "En matière de développement informatique, mes compétences sont très larges.",
            "De l'indémodable C, langage mère de tous les autres, en passant par le Javascript, très utilisé dans le web et le mobile, je peux aussi coder en Java pour des applications un peu plus lourdes, nécessitant une gestion fine de la mémoire.",
            "Le PHP, pour les sites web dynamiques, et Python, pour sa simplicité et sa puissance, font également partie de ma panoplie.",
            "Outre ces langages, j'ai acquis une compétence solide dans divers frameworks. React, pour le développement d'interfaces utilisateur efficaces et interactives ; NodeJs et Express, pour le développement côté serveur et la gestion des requêtes ainsi que l'interaction avec une base de données",
            "Au-delà de ces compétences en programmation, j'ai aussi des connaissances en outils de versioning et d'exploitation comme Git et Linux. Je peux gérer différentes versions d'un même programme grâce à Git et m'occuper de l'administration système basique grâce à Linux. J'ai également des compétences en serveur Web Apache, ce qui me permet de gérer le déploiement d'applications web.",
            "En outre, je suis capable de travailler sur la conception d'interfaces utilisateur avec Figma. Cet outil me permet de réaliser des maquettes et des prototypes interactifs, ce qui est indispensable pour avoir une idée précise du rendu final d'une application avant de passer à sa réalisation.",
            " Au-delà des compétences techniques, j'ai développé au cours de ma carrière une grande polyvalence. En effet, j'estime que dans notre domaine, il est essentiel de pouvoir s'adapter aux différentes situations et technologies que nous pouvons rencontrer. De plus, je suis convaincu que les compétences sociales sont tout aussi importantes que les compétences techniques. Ainsi, j'ai appris à communiquer efficacement avec mes collègues et clients pour bien comprendre leurs besoins et leurs contraintes."
        ]
    }
}